Revit 2026 API

# HostObjectUtils Methods

---

The HostObjectUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetBottomFaces | Returns the bottom faces for this host object. |
|  | GetSideFaces | Returns the major side faces for this host object. |
|  | GetTopFaces | Returns the top faces for this host object. |

#### Reference

HostObjectUtils Class

Autodesk.Revit.DB Namespace